{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": null,
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "[UNK]",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[UNK]": 0,
      "[PAD]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      ",": 5,
      "a": 6,
      "c": 7,
      "e": 8,
      "g": 9,
      "i": 10,
      "l": 11,
      "m": 12,
      "n": 13,
      "o": 14,
      "p": 15,
      "r": 16,
      "s": 17,
      "x": 18,
      "ء": 19,
      "أ": 20,
      "ؤ": 21,
      "إ": 22,
      "ئ": 23,
      "ا": 24,
      "ب": 25,
      "ة": 26,
      "ت": 27,
      "ث": 28,
      "ج": 29,
      "ح": 30,
      "خ": 31,
      "د": 32,
      "ر": 33,
      "س": 34,
      "ش": 35,
      "ص": 36,
      "ط": 37,
      "ع": 38,
      "ف": 39,
      "ق": 40,
      "ك": 41,
      "ل": 42,
      "م": 43,
      "ن": 44,
      "ه": 45,
      "و": 46,
      "ى": 47,
      "ي": 48,
      "ال": 49,
      "الت": 50,
      "ar": 51,
      "عل": 52,
      "في": 53,
      "جا": 54,
      "ول": 55,
      "ية": 56,
      "بي": 57,
      "هم": 58,
      "الع": 59,
      "الم": 60,
      "تم": 61,
      "رة": 62,
      "مهم": 63,
      "يا": 64,
      "الأ": 65,
      "الا": 66,
      "على": 67,
      "حق": 68,
      "دا": 69,
      "دول": 70,
      "سا": 71,
      "قو": 72,
      "كل": 73,
      "وا": 74,
      "الدول": 75,
      "ولو": 76,
      "le": 77,
      "mp": 78,
      "إل": 79,
      "ئة": 80,
      "اد": 81,
      "ار": 82,
      "او": 83,
      "اية": 84,
      "بت": 85,
      "بش": 86,
      "تا": 87,
      "تص": 88,
      "تط": 89,
      "جيا": 90,
      "حة": 91,
      "حم": 92,
      "دي": 93,
      "رت": 94,
      "رف": 95,
      "صل": 96,
      "صحة": 97,
      "عد": 98,
      "عتم": 99,
      "عاو": 100,
      "عرف": 101,
      "قتص": 102,
      "كن": 103,
      "كبي": 104,
      "كار": 105,
      "مل": 106,
      "من": 107,
      "مفي": 108,
      "نجا": 109,
      "هو": 110,
      "هدا": 111,
      "ورت": 112,
      "يق": 113,
      "يم": 114,
      "يسا": 115,
      "يعتم": 116,
      "الح": 117,
      "الجا": 118,
      "البي": 119,
      "الصحة": 120,
      "التعل": 121,
      "التجا": 122,
      "التوا": 123,
      "التعاو": 124,
      "التكن": 125,
      "العالم": 126,
      "العمل": 127,
      "المعرف": 128,
      "مهمة": 129,
      "الأهدا": 130,
      "الابت": 131,
      "الاقتص": 132,
      "حقيق": 133,
      "قوة": 134,
      "ولوجيا": 135,
      "mple": 136,
      "إلى": 137,
      "بشكل": 138,
      "تطورت": 139,
      "حماية": 140,
      "كبير": 141,
      "مفيد": 142,
      "نجاح": 143,
      "يساعد": 144,
      "يعتمد": 145,
      "الجاد": 146,
      "البيئة": 147,
      "التعليم": 148,
      "التجارة": 149,
      "التواصل": 150,
      "التعاون": 151,
      "التكنولوجيا": 152,
      "المعرفة": 153,
      "الأهداف": 154,
      "الابتكار": 155,
      "الاقتصاد": 156
    },
    "merges": [
      [
        "ا",
        "ل"
      ],
      [
        "ال",
        "ت"
      ],
      [
        "a",
        "r"
      ],
      [
        "ع",
        "ل"
      ],
      [
        "ف",
        "ي"
      ],
      [
        "ج",
        "ا"
      ],
      [
        "و",
        "ل"
      ],
      [
        "ي",
        "ة"
      ],
      [
        "ب",
        "ي"
      ],
      [
        "ه",
        "م"
      ],
      [
        "ال",
        "ع"
      ],
      [
        "ال",
        "م"
      ],
      [
        "ت",
        "م"
      ],
      [
        "ر",
        "ة"
      ],
      [
        "م",
        "هم"
      ],
      [
        "ي",
        "ا"
      ],
      [
        "ال",
        "أ"
      ],
      [
        "ال",
        "ا"
      ],
      [
        "عل",
        "ى"
      ],
      [
        "ح",
        "ق"
      ],
      [
        "د",
        "ا"
      ],
      [
        "د",
        "ول"
      ],
      [
        "س",
        "ا"
      ],
      [
        "ق",
        "و"
      ],
      [
        "ك",
        "ل"
      ],
      [
        "و",
        "ا"
      ],
      [
        "ال",
        "دول"
      ],
      [
        "ول",
        "و"
      ],
      [
        "l",
        "e"
      ],
      [
        "m",
        "p"
      ],
      [
        "إ",
        "ل"
      ],
      [
        "ئ",
        "ة"
      ],
      [
        "ا",
        "د"
      ],
      [
        "ا",
        "ر"
      ],
      [
        "ا",
        "و"
      ],
      [
        "ا",
        "ية"
      ],
      [
        "ب",
        "ت"
      ],
      [
        "ب",
        "ش"
      ],
      [
        "ت",
        "ا"
      ],
      [
        "ت",
        "ص"
      ],
      [
        "ت",
        "ط"
      ],
      [
        "ج",
        "يا"
      ],
      [
        "ح",
        "ة"
      ],
      [
        "ح",
        "م"
      ],
      [
        "د",
        "ي"
      ],
      [
        "ر",
        "ت"
      ],
      [
        "ر",
        "ف"
      ],
      [
        "ص",
        "ل"
      ],
      [
        "ص",
        "حة"
      ],
      [
        "ع",
        "د"
      ],
      [
        "ع",
        "تم"
      ],
      [
        "ع",
        "او"
      ],
      [
        "ع",
        "رف"
      ],
      [
        "ق",
        "تص"
      ],
      [
        "ك",
        "ن"
      ],
      [
        "ك",
        "بي"
      ],
      [
        "ك",
        "ار"
      ],
      [
        "م",
        "ل"
      ],
      [
        "م",
        "ن"
      ],
      [
        "م",
        "في"
      ],
      [
        "ن",
        "جا"
      ],
      [
        "ه",
        "و"
      ],
      [
        "ه",
        "دا"
      ],
      [
        "و",
        "رت"
      ],
      [
        "ي",
        "ق"
      ],
      [
        "ي",
        "م"
      ],
      [
        "ي",
        "سا"
      ],
      [
        "ي",
        "عتم"
      ],
      [
        "ال",
        "ح"
      ],
      [
        "ال",
        "جا"
      ],
      [
        "ال",
        "بي"
      ],
      [
        "ال",
        "صحة"
      ],
      [
        "الت",
        "عل"
      ],
      [
        "الت",
        "جا"
      ],
      [
        "الت",
        "وا"
      ],
      [
        "الت",
        "عاو"
      ],
      [
        "الت",
        "كن"
      ],
      [
        "الع",
        "الم"
      ],
      [
        "الع",
        "مل"
      ],
      [
        "الم",
        "عرف"
      ],
      [
        "مهم",
        "ة"
      ],
      [
        "الأ",
        "هدا"
      ],
      [
        "الا",
        "بت"
      ],
      [
        "الا",
        "قتص"
      ],
      [
        "حق",
        "يق"
      ],
      [
        "قو",
        "ة"
      ],
      [
        "ولو",
        "جيا"
      ],
      [
        "mp",
        "le"
      ],
      [
        "إل",
        "ى"
      ],
      [
        "بش",
        "كل"
      ],
      [
        "تط",
        "ورت"
      ],
      [
        "حم",
        "اية"
      ],
      [
        "كبي",
        "ر"
      ],
      [
        "مفي",
        "د"
      ],
      [
        "نجا",
        "ح"
      ],
      [
        "يسا",
        "عد"
      ],
      [
        "يعتم",
        "د"
      ],
      [
        "الجا",
        "د"
      ],
      [
        "البي",
        "ئة"
      ],
      [
        "التعل",
        "يم"
      ],
      [
        "التجا",
        "رة"
      ],
      [
        "التوا",
        "صل"
      ],
      [
        "التعاو",
        "ن"
      ],
      [
        "التكن",
        "ولوجيا"
      ],
      [
        "المعرف",
        "ة"
      ],
      [
        "الأهدا",
        "ف"
      ],
      [
        "الابت",
        "كار"
      ],
      [
        "الاقتص",
        "اد"
      ]
    ]
  }
}